_org_posts/_posts/2022-01-31-boj-1406.org
#+HTML: ---
#+HTML: title: BOJ 1406 에디터
#+HTML: tags: STL 리스트
#+HTML: toc: true
#+HTML: toc_sticky: true
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 1406 에디터
- STL list를 이용하는 문제

** 접근하기
#+BEGIN_EXAMPLE
abcd
3
P x
L
P y

lst = abcd($)       ($ == lst.end()에 cursor)
P x
lst = abcdx($)      // 커서는 그대로
L
lst = abcd(x)$
P y 
lst = abcdy(x)$
#+END_EXAMPLE
- 1. push_back후 맨 마지막에 cursor를 가리키기

** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;
#define FASTIO ios_base::sync_with_stdio(false); cin.tie(nullptr);
typedef long long ll;

int N;
char str[100010];

int main(int argc, char* argv[])
{
    FASTIO;
    cin >> str;
    cin >> N;
    list<char> l;
    for(int i=0;str[i];i++) {
        l.push_back(str[i]);
    }
    auto cursor = l.end();

    char cmd;
    char ch;
    for(int i=0;i<N;i++) {
        cin >> cmd;
        switch(cmd) {
        case 'L':
            if (l.begin() != cursor) {
                cursor--; 
            }
            break;
        case 'D':
            if (l.end() != cursor) {
                cursor++; 
            }
            break;
        case 'B':
            if (l.begin() != cursor) {
	        // 커서 왼쪽에 있는 문자를 삭제
                // 커서의 오른쪽에 있던 문자는 그대로임
                cursor = l.erase(--cursor);  // remove left  
            }
            break;
        case 'P':
            cin >> ch;
            l.insert(cursor, ch);  // insert left  
            break;
        }
    }
    for(auto& o : l) {
        cout << o;
    }
    cout << '\n';

    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/1406
